Microchip-MPLAB-Harmony/ethercat/apps/ethercat_counter_foe_app/firmware/src/packs/ATSAME53J20A_DFP/component/rtc.h
#define RTC_MODE2_TIMESTAMP_SECOND_Pos        _U_(0)                                               /**< (RTC_MODE2_TIMESTAMP) Second Timestamp Value Position */
#define RTC_MODE2_TIMESTAMP_SECOND_Msk        (_U_(0x3F) << RTC_MODE2_TIMESTAMP_SECOND_Pos)        /**< (RTC_MODE2_TIMESTAMP) Second Timestamp Value Mask */
#define RTC_MODE2_TIMESTAMP_SECOND(value)     (RTC_MODE2_TIMESTAMP_SECOND_Msk & ((value) << RTC_MODE2_TIMESTAMP_SECOND_Pos))
#define RTC_MODE2_TIMESTAMP_MINUTE_Pos        _U_(6)                                               /**< (RTC_MODE2_TIMESTAMP) Minute Timestamp Value Position */
#define RTC_MODE2_TIMESTAMP_MINUTE_Msk        (_U_(0x3F) << RTC_MODE2_TIMESTAMP_MINUTE_Pos)        /**< (RTC_MODE2_TIMESTAMP) Minute Timestamp Value Mask */
#define RTC_MODE2_TIMESTAMP_MINUTE(value)     (RTC_MODE2_TIMESTAMP_MINUTE_Msk & ((value) << RTC_MODE2_TIMESTAMP_MINUTE_Pos))
#define RTC_MODE2_TIMESTAMP_HOUR_Pos          _U_(12)                                              /**< (RTC_MODE2_TIMESTAMP) Hour Timestamp Value Position */
#define RTC_MODE2_TIMESTAMP_HOUR_Msk          (_U_(0x1F) << RTC_MODE2_TIMESTAMP_HOUR_Pos)          /**< (RTC_MODE2_TIMESTAMP) Hour Timestamp Value Mask */
#define RTC_MODE2_TIMESTAMP_HOUR(value)       (RTC_MODE2_TIMESTAMP_HOUR_Msk & ((value) << RTC_MODE2_TIMESTAMP_HOUR_Pos))
#define   RTC_MODE2_TIMESTAMP_HOUR_AM_Val     _U_(0x0)                                             /**< (RTC_MODE2_TIMESTAMP) AM when CLKREP in 12-hour  */
#define   RTC_MODE2_TIMESTAMP_HOUR_PM_Val     _U_(0x10)                                            /**< (RTC_MODE2_TIMESTAMP) PM when CLKREP in 12-hour  */
#define RTC_MODE2_TIMESTAMP_HOUR_AM           (RTC_MODE2_TIMESTAMP_HOUR_AM_Val << RTC_MODE2_TIMESTAMP_HOUR_Pos) /**< (RTC_MODE2_TIMESTAMP) AM when CLKREP in 12-hour Position  */
#define RTC_MODE2_TIMESTAMP_HOUR_PM           (RTC_MODE2_TIMESTAMP_HOUR_PM_Val << RTC_MODE2_TIMESTAMP_HOUR_Pos) /**< (RTC_MODE2_TIMESTAMP) PM when CLKREP in 12-hour Position  */
#define RTC_MODE2_TIMESTAMP_DAY_Pos           _U_(17)                                              /**< (RTC_MODE2_TIMESTAMP) Day Timestamp Value Position */
#define RTC_MODE2_TIMESTAMP_DAY_Msk           (_U_(0x1F) << RTC_MODE2_TIMESTAMP_DAY_Pos)           /**< (RTC_MODE2_TIMESTAMP) Day Timestamp Value Mask */
#define RTC_MODE2_TIMESTAMP_DAY(value)        (RTC_MODE2_TIMESTAMP_DAY_Msk & ((value) << RTC_MODE2_TIMESTAMP_DAY_Pos))
#define RTC_MODE2_TIMESTAMP_MONTH_Pos         _U_(22)                                              /**< (RTC_MODE2_TIMESTAMP) Month Timestamp Value Position */
#define RTC_MODE2_TIMESTAMP_MONTH_Msk         (_U_(0xF) << RTC_MODE2_TIMESTAMP_MONTH_Pos)          /**< (RTC_MODE2_TIMESTAMP) Month Timestamp Value Mask */
#define RTC_MODE2_TIMESTAMP_MONTH(value)      (RTC_MODE2_TIMESTAMP_MONTH_Msk & ((value) << RTC_MODE2_TIMESTAMP_MONTH_Pos))
#define RTC_MODE2_TIMESTAMP_YEAR_Pos          _U_(26)                                              /**< (RTC_MODE2_TIMESTAMP) Year Timestamp Value Position */
#define RTC_MODE2_TIMESTAMP_YEAR_Msk          (_U_(0x3F) << RTC_MODE2_TIMESTAMP_YEAR_Pos)          /**< (RTC_MODE2_TIMESTAMP) Year Timestamp Value Mask */
#define RTC_MODE2_TIMESTAMP_YEAR(value)       (RTC_MODE2_TIMESTAMP_YEAR_Msk & ((value) << RTC_MODE2_TIMESTAMP_YEAR_Pos))
#define RTC_MODE2_TIMESTAMP_Msk               _U_(0xFFFFFFFF)                                      /**< (RTC_MODE2_TIMESTAMP) Register Mask  */


/* -------- RTC_TAMPID : (RTC Offset: 0x68) (R/W 32) Tamper ID -------- */
#define RTC_TAMPID_RESETVALUE                 _U_(0x00)                                            /**<  (RTC_TAMPID) Tamper ID  Reset Value */

#define RTC_TAMPID_TAMPID0_Pos                _U_(0)                                               /**< (RTC_TAMPID) Tamper Input 0 Detected Position */
#define RTC_TAMPID_TAMPID0_Msk                (_U_(0x1) << RTC_TAMPID_TAMPID0_Pos)                 /**< (RTC_TAMPID) Tamper Input 0 Detected Mask */
#define RTC_TAMPID_TAMPID0(value)             (RTC_TAMPID_TAMPID0_Msk & ((value) << RTC_TAMPID_TAMPID0_Pos))
#define RTC_TAMPID_TAMPID1_Pos                _U_(1)                                               /**< (RTC_TAMPID) Tamper Input 1 Detected Position */
#define RTC_TAMPID_TAMPID1_Msk                (_U_(0x1) << RTC_TAMPID_TAMPID1_Pos)                 /**< (RTC_TAMPID) Tamper Input 1 Detected Mask */
#define RTC_TAMPID_TAMPID1(value)             (RTC_TAMPID_TAMPID1_Msk & ((value) << RTC_TAMPID_TAMPID1_Pos))
#define RTC_TAMPID_TAMPID2_Pos                _U_(2)                                               /**< (RTC_TAMPID) Tamper Input 2 Detected Position */
#define RTC_TAMPID_TAMPID2_Msk                (_U_(0x1) << RTC_TAMPID_TAMPID2_Pos)                 /**< (RTC_TAMPID) Tamper Input 2 Detected Mask */
#define RTC_TAMPID_TAMPID2(value)             (RTC_TAMPID_TAMPID2_Msk & ((value) << RTC_TAMPID_TAMPID2_Pos))
#define RTC_TAMPID_TAMPID3_Pos                _U_(3)                                               /**< (RTC_TAMPID) Tamper Input 3 Detected Position */
#define RTC_TAMPID_TAMPID3_Msk                (_U_(0x1) << RTC_TAMPID_TAMPID3_Pos)                 /**< (RTC_TAMPID) Tamper Input 3 Detected Mask */
#define RTC_TAMPID_TAMPID3(value)             (RTC_TAMPID_TAMPID3_Msk & ((value) << RTC_TAMPID_TAMPID3_Pos))
#define RTC_TAMPID_TAMPID4_Pos                _U_(4)                                               /**< (RTC_TAMPID) Tamper Input 4 Detected Position */
#define RTC_TAMPID_TAMPID4_Msk                (_U_(0x1) << RTC_TAMPID_TAMPID4_Pos)                 /**< (RTC_TAMPID) Tamper Input 4 Detected Mask */
#define RTC_TAMPID_TAMPID4(value)             (RTC_TAMPID_TAMPID4_Msk & ((value) << RTC_TAMPID_TAMPID4_Pos))
#define RTC_TAMPID_TAMPEVT_Pos                _U_(31)                                              /**< (RTC_TAMPID) Tamper Event Detected Position */
#define RTC_TAMPID_TAMPEVT_Msk                (_U_(0x1) << RTC_TAMPID_TAMPEVT_Pos)                 /**< (RTC_TAMPID) Tamper Event Detected Mask */
#define RTC_TAMPID_TAMPEVT(value)             (RTC_TAMPID_TAMPEVT_Msk & ((value) << RTC_TAMPID_TAMPEVT_Pos))
#define RTC_TAMPID_Msk                        _U_(0x8000001F)                                      /**< (RTC_TAMPID) Register Mask  */

#define RTC_TAMPID_TAMPID_Pos                 _U_(0)                                               /**< (RTC_TAMPID Position) Tamper Input x Detected */
#define RTC_TAMPID_TAMPID_Msk                 (_U_(0x1F) << RTC_TAMPID_TAMPID_Pos)                 /**< (RTC_TAMPID Mask) TAMPID */
#define RTC_TAMPID_TAMPID(value)              (RTC_TAMPID_TAMPID_Msk & ((value) << RTC_TAMPID_TAMPID_Pos)) 

/* -------- RTC_BKUP : (RTC Offset: 0x80) (R/W 32) Backup -------- */
#define RTC_BKUP_RESETVALUE                   _U_(0x00)                                            /**<  (RTC_BKUP) Backup  Reset Value */

#define RTC_BKUP_BKUP_Pos                     _U_(0)                                               /**< (RTC_BKUP) Backup Position */
#define RTC_BKUP_BKUP_Msk                     (_U_(0xFFFFFFFF) << RTC_BKUP_BKUP_Pos)               /**< (RTC_BKUP) Backup Mask */
#define RTC_BKUP_BKUP(value)                  (RTC_BKUP_BKUP_Msk & ((value) << RTC_BKUP_BKUP_Pos))
#define RTC_BKUP_Msk                          _U_(0xFFFFFFFF)                                      /**< (RTC_BKUP) Register Mask  */


/** \brief RTC register offsets definitions */
#define RTC_MODE0_CTRLA_REG_OFST       (0x00)              /**< (RTC_MODE0_CTRLA) MODE0 Control A Offset */
#define RTC_MODE1_CTRLA_REG_OFST       (0x00)              /**< (RTC_MODE1_CTRLA) MODE1 Control A Offset */
#define RTC_MODE2_CTRLA_REG_OFST       (0x00)              /**< (RTC_MODE2_CTRLA) MODE2 Control A Offset */
#define RTC_MODE0_CTRLB_REG_OFST       (0x02)              /**< (RTC_MODE0_CTRLB) MODE0 Control B Offset */
#define RTC_MODE1_CTRLB_REG_OFST       (0x02)              /**< (RTC_MODE1_CTRLB) MODE1 Control B Offset */
#define RTC_MODE2_CTRLB_REG_OFST       (0x02)              /**< (RTC_MODE2_CTRLB) MODE2 Control B Offset */
#define RTC_MODE0_EVCTRL_REG_OFST      (0x04)              /**< (RTC_MODE0_EVCTRL) MODE0 Event Control Offset */
#define RTC_MODE1_EVCTRL_REG_OFST      (0x04)              /**< (RTC_MODE1_EVCTRL) MODE1 Event Control Offset */
#define RTC_MODE2_EVCTRL_REG_OFST      (0x04)              /**< (RTC_MODE2_EVCTRL) MODE2 Event Control Offset */
#define RTC_MODE0_INTENCLR_REG_OFST    (0x08)              /**< (RTC_MODE0_INTENCLR) MODE0 Interrupt Enable Clear Offset */
#define RTC_MODE1_INTENCLR_REG_OFST    (0x08)              /**< (RTC_MODE1_INTENCLR) MODE1 Interrupt Enable Clear Offset */
#define RTC_MODE2_INTENCLR_REG_OFST    (0x08)              /**< (RTC_MODE2_INTENCLR) MODE2 Interrupt Enable Clear Offset */
#define RTC_MODE0_INTENSET_REG_OFST    (0x0A)              /**< (RTC_MODE0_INTENSET) MODE0 Interrupt Enable Set Offset */
#define RTC_MODE1_INTENSET_REG_OFST    (0x0A)              /**< (RTC_MODE1_INTENSET) MODE1 Interrupt Enable Set Offset */
#define RTC_MODE2_INTENSET_REG_OFST    (0x0A)              /**< (RTC_MODE2_INTENSET) MODE2 Interrupt Enable Set Offset */
#define RTC_MODE0_INTFLAG_REG_OFST     (0x0C)              /**< (RTC_MODE0_INTFLAG) MODE0 Interrupt Flag Status and Clear Offset */
#define RTC_MODE1_INTFLAG_REG_OFST     (0x0C)              /**< (RTC_MODE1_INTFLAG) MODE1 Interrupt Flag Status and Clear Offset */
#define RTC_MODE2_INTFLAG_REG_OFST     (0x0C)              /**< (RTC_MODE2_INTFLAG) MODE2 Interrupt Flag Status and Clear Offset */
#define RTC_DBGCTRL_REG_OFST           (0x0E)              /**< (RTC_DBGCTRL) Debug Control Offset */
#define RTC_MODE0_SYNCBUSY_REG_OFST    (0x10)              /**< (RTC_MODE0_SYNCBUSY) MODE0 Synchronization Busy Status Offset */
#define RTC_MODE1_SYNCBUSY_REG_OFST    (0x10)              /**< (RTC_MODE1_SYNCBUSY) MODE1 Synchronization Busy Status Offset */
#define RTC_MODE2_SYNCBUSY_REG_OFST    (0x10)              /**< (RTC_MODE2_SYNCBUSY) MODE2 Synchronization Busy Status Offset */
#define RTC_FREQCORR_REG_OFST          (0x14)              /**< (RTC_FREQCORR) Frequency Correction Offset */
#define RTC_MODE0_COUNT_REG_OFST       (0x18)              /**< (RTC_MODE0_COUNT) MODE0 Counter Value Offset */
#define RTC_MODE1_COUNT_REG_OFST       (0x18)              /**< (RTC_MODE1_COUNT) MODE1 Counter Value Offset */
#define RTC_MODE2_CLOCK_REG_OFST       (0x18)              /**< (RTC_MODE2_CLOCK) MODE2 Clock Value Offset */
#define RTC_MODE1_PER_REG_OFST         (0x1C)              /**< (RTC_MODE1_PER) MODE1 Counter Period Offset */
#define RTC_MODE0_COMP_REG_OFST        (0x20)              /**< (RTC_MODE0_COMP) MODE0 Compare n Value Offset */
#define RTC_MODE0_COMP0_REG_OFST       (0x20)              /**< (RTC_MODE0_COMP0) MODE0 Compare n Value Offset */
#define RTC_MODE0_COMP1_REG_OFST       (0x24)              /**< (RTC_MODE0_COMP1) MODE0 Compare n Value Offset */
#define RTC_MODE1_COMP_REG_OFST        (0x20)              /**< (RTC_MODE1_COMP) MODE1 Compare n Value Offset */
#define RTC_MODE1_COMP0_REG_OFST       (0x20)              /**< (RTC_MODE1_COMP0) MODE1 Compare n Value Offset */
#define RTC_MODE1_COMP1_REG_OFST       (0x22)              /**< (RTC_MODE1_COMP1) MODE1 Compare n Value Offset */
#define RTC_MODE1_COMP2_REG_OFST       (0x24)              /**< (RTC_MODE1_COMP2) MODE1 Compare n Value Offset */
#define RTC_MODE1_COMP3_REG_OFST       (0x26)              /**< (RTC_MODE1_COMP3) MODE1 Compare n Value Offset */
#define RTC_GP_REG_OFST                (0x40)              /**< (RTC_GP) General Purpose Offset */
#define RTC_GP0_REG_OFST               (0x40)              /**< (RTC_GP0) General Purpose Offset */
#define RTC_GP1_REG_OFST               (0x44)              /**< (RTC_GP1) General Purpose Offset */
#define RTC_GP2_REG_OFST               (0x48)              /**< (RTC_GP2) General Purpose Offset */
#define RTC_GP3_REG_OFST               (0x4C)              /**< (RTC_GP3) General Purpose Offset */
#define RTC_MODE2_ALARM0_REG_OFST      (0x20)              /**< (RTC_MODE2_ALARM0) MODE2_ALARM Alarm n Value Offset */
#define RTC_MODE2_MASK0_REG_OFST       (0x24)              /**< (RTC_MODE2_MASK0) MODE2_ALARM Alarm n Mask Offset */
#define RTC_MODE2_ALARM1_REG_OFST      (0x28)              /**< (RTC_MODE2_ALARM1) MODE2_ALARM Alarm n Value Offset */
#define RTC_MODE2_MASK1_REG_OFST       (0x2C)              /**< (RTC_MODE2_MASK1) MODE2_ALARM Alarm n Mask Offset */
#define RTC_TAMPCTRL_REG_OFST          (0x60)              /**< (RTC_TAMPCTRL) Tamper Control Offset */
#define RTC_MODE0_TIMESTAMP_REG_OFST   (0x64)              /**< (RTC_MODE0_TIMESTAMP) MODE0 Timestamp Offset */
#define RTC_MODE1_TIMESTAMP_REG_OFST   (0x64)              /**< (RTC_MODE1_TIMESTAMP) MODE1 Timestamp Offset */
#define RTC_MODE2_TIMESTAMP_REG_OFST   (0x64)              /**< (RTC_MODE2_TIMESTAMP) MODE2 Timestamp Offset */
#define RTC_TAMPID_REG_OFST            (0x68)              /**< (RTC_TAMPID) Tamper ID Offset */
#define RTC_BKUP_REG_OFST              (0x80)              /**< (RTC_BKUP) Backup Offset */
#define RTC_BKUP0_REG_OFST             (0x80)              /**< (RTC_BKUP0) Backup Offset */
#define RTC_BKUP1_REG_OFST             (0x84)              /**< (RTC_BKUP1) Backup Offset */
#define RTC_BKUP2_REG_OFST             (0x88)              /**< (RTC_BKUP2) Backup Offset */
#define RTC_BKUP3_REG_OFST             (0x8C)              /**< (RTC_BKUP3) Backup Offset */
#define RTC_BKUP4_REG_OFST             (0x90)              /**< (RTC_BKUP4) Backup Offset */
#define RTC_BKUP5_REG_OFST             (0x94)              /**< (RTC_BKUP5) Backup Offset */
#define RTC_BKUP6_REG_OFST             (0x98)              /**< (RTC_BKUP6) Backup Offset */
#define RTC_BKUP7_REG_OFST             (0x9C)              /**< (RTC_BKUP7) Backup Offset */

